[
    {
        "title": "Is the GENIUS Act an answer to Stablecoin regulation in the US? All about first-of-its-kind cryptocurrency legislation",
        "description": "The US Senate has advanced the GENIUS Act, a bipartisan bill aimed at regulating stablecoins, with a 66-32 vote. This significant step towards formal oversight of the digital asset space establishes a regulatory framework for stablecoin issuers. The legislati…",
        "content": "The US Senate has advanced the GENIUS Act, a bill aimed at regulating stablecoins, following 66-32 vote on Monday, two weeks after Democrats blocked the measure. The Senate voted to move forward with… [+3300 chars]",
        "published_at": "2025-05-20T12:51:49Z",
        "source": "The Times of India",
        "url": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-is-the-genius-act-an-answer-to-stablecoin-regulation-in-the-us-all-about-first-of-its-kind-cryptocurrency-legislation/articleshow/121293971.cms"
    },
    {
        "title": "China-linked UnsolicitedBooker APT used new backdoor MarsSnake in recent attacks",
        "description": "China-linked UnsolicitedBooker used a new backdoor, MarsSnake, to target an international organization in Saudi Arabia. ESET researchers revealed that a China-linked APT, tracked as UnsolicitedBooker, targeted an international organization in Saudi Arabia usi…",
        "content": "China-linked UnsolicitedBooker APT used new backdoor MarsSnake in recent attacks\r\n | UKs Legal Aid Agency discloses a data breach following April cyber attack\r\n | Sarcoma Ransomware Unveiled: Anatomy… [+165983 chars]",
        "published_at": "2025-05-20T12:44:24Z",
        "source": "Securityaffairs.com",
        "url": "https://securityaffairs.com/178105/malware/china-linked-unsolicitedbooker-used-new-backdoor-marssnake.html"
    },
    {
        "title": "Canada just got a gold and glass coin and you'll be surprised what it weighs",
        "description": "Canada has a flashy new 3D coin that collectors will probably need to pay for in instalments.The Royal Canadian Mint released the Murano Monarch Butterfly — Half Kilo Fine Silver Coin, which features its biggest Murano glass butterfly yet.The 3D glass butterf…",
        "content": "Canada has a flashy new 3D coin that collectors will probably need to pay for in instalments.\r\nThe Royal Canadian Mint released the Murano Monarch Butterfly — Half Kilo Fine Silver Coin, which featur… [+2505 chars]",
        "published_at": "2025-05-20T12:25:02Z",
        "source": "Daily Hive",
        "url": "https://dailyhive.com/canada/canada-half-kilo-3d-coin"
    },
    {
        "title": "The Ultimate Guide to Blue Tie-Dye Sweatshirts: Styles, Tips, and Where to Buy",
        "description": "A Look Back: The Genesis of Tie-Dye Tie-dye, in its essence, is a resist dyeing technique, a method of creating […]\nThe post The Ultimate Guide to Blue Tie-Dye Sweatshirts: Styles, Tips, and Where to Buy appeared first on Things You Ought to Know.",
        "content": "A Look Back: The Genesis of Tie-Dye\r\nTie-dye, in its essence, is a resist dyeing technique, a method of creating patterns on fabric by tying or clamping the fabric in specific ways before applying dy… [+11332 chars]",
        "published_at": "2025-05-20T12:03:41Z",
        "source": "Ie.edu",
        "url": "https://entrepreneurship.blogs.ie.edu/the-ultimate-guide-to-blue-tie-dye-sweatshirts-styles-tips-and-where-to-buy/"
    },
    {
        "title": "Hot Take: The New MB&F SP One Is Classic MB&F Yet Anything But",
        "description": "What happens when one of horology’s most radical voices tries its hand at something classically elegant? You get the MB&F SP One. At just 38mm across and 12mm thick, it’s the smallest and slimmest watch the brand has ever made. But don’t let that fool you. Th…",
        "content": "What happens when one of horologys most radical voices tries its hand at something classically elegant? You get the MB&amp;F SP One. At just 38mm across and 12mm thick, its the smallest and slimmest … [+5028 chars]",
        "published_at": "2025-05-20T12:00:05Z",
        "source": "Fratellowatches.com",
        "url": "https://www.fratellowatches.com/hot-take-the-new-mbf-sp-one-is-classic-mbf-yet-anything-but/"
    },
    {
        "title": "Top 5 Gaming Consoles To Consider In May 2025 For Every Gamer",
        "description": "Top 5 Gaming Consoles To Consider In May 2025 For Every GamerGaming consoles have come a long way from the days of simple joysticks and monochrome screens. As we move further into 2025, the landscape continues...",
        "content": "Gaming consoles have come a long way from the days of simple joysticks and monochrome screens. As we move further into 2025, the landscape continues to evolve rapidly, with new devices blurring the b… [+7148 chars]",
        "published_at": "2025-05-20T11:40:52Z",
        "source": "Yanko Design",
        "url": "https://www.yankodesign.com/2025/05/20/top-5-gaming-consoles-to-consider-in-may-2025-for-every-gamer/"
    },
    {
        "title": "Amazon has latest Beats Pill with 24-hr. battery and Find My back at $100 lows (5 color options)",
        "description": "Amazon has now brought back its all-time low pricing on the latest Beats Pill portable Bluetooth speaker at $99.95 shipped. This time around, the regularly $150 speaker has now dropped $50 in all five of the colors Amazon carries: Matte Black, Statement Red, …",
        "content": "Amazon has now brought back its all-time low pricing on the latest Beats Pill portable Bluetooth speaker at $99.95 shipped. This time around, the regularly $150 speaker has now dropped $50 in all fiv… [+2448 chars]",
        "published_at": "2025-05-20T11:35:00Z",
        "source": "9to5Toys",
        "url": "http://9to5toys.com/2025/05/20/amazon-latest-beats-pill-fnd-my/"
    },
    {
        "title": "Dynacor Group Reports Sales of US$22.8 Million in April 2025",
        "description": "MONTREAL — Dynacor Group Inc. (TSX-DNG) (“Dynacor” or the “Corporation”), today announced unaudited gold sales of $22.8 million in April and year-to-date sales of $102.8 million. All figures are in US dollars unless otherwise indicated. Monthly Highlights Gol…",
        "content": "MONTREAL Dynacor Group Inc. (TSX-DNG) (Dynacor or the Corporation), today announced unaudited gold sales of $22.8 million in April and year-to-date sales of $102.8 million. All figures are in US doll… [+5361 chars]",
        "published_at": "2025-05-20T11:33:13Z",
        "source": "Financial Post",
        "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/dynacor-group-reports-sales-of-us22-8-million-in-april-2025"
    },
    {
        "title": "Huawei Officially Reveals Its First Foldable Laptop",
        "description": "Huawei made a stunning entry into the foldable laptop market. The brand introduced its first-ever mass-market foldable laptop called the MateBook X Fold Ultimate Design. ...\nThe post Huawei Officially Reveals Its First Foldable Laptop appeared first on Gizchi…",
        "content": "Huawei made a stunning entry into the foldable laptop market. The brand introduced its first-ever mass-market foldable laptop called the MateBook X Fold Ultimate Design. The laptop not only stands ou… [+2652 chars]",
        "published_at": "2025-05-20T11:22:35Z",
        "source": "Gizchina.com",
        "url": "https://www.gizchina.com/2025/05/20/huawei-officially-reveals-its-first-foldable-laptop/"
    },
    {
        "title": "How Low Can Bitcoin Go?",
        "description": "The roller coaster ride that is Bitcoin (BTCUSD) prices continues, but is the cryptocurrency really \"digital gold\"?",
        "content": "This illustration photograph taken on November 22, 2024 in Istanbul shows a coin imitation of the ... More Bitcoin crypto currency arranged beside a screen displaying a trading chart. (Photo by Ozan … [+3519 chars]",
        "published_at": "2025-05-20T11:09:34Z",
        "source": "Forbes",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/05/20/how-low-can-bitcoin-go/"
    },
    {
        "title": "Today’s Gold Rate in India on May 20, 2025: Gold prices down by around ₹45 in Ahmedabad, Mumbai, Kolkata, Bengaluru, Delhi and Chennai",
        "description": "Today's 22-carat gold prices in India dipped by ₹45 per gram on May 20, with 24-carat gold down by ₹48 compared to yesterday.",
        "content": "Gold prices in India saw decrease today across all cities. The price for 8 grams of 24-carat gold also dropped in all cities compared to yesterday. Below is a detailed breakdown of gold prices in key… [+2528 chars]",
        "published_at": "2025-05-20T11:09:16Z",
        "source": "BusinessLine",
        "url": "https://www.thehindubusinessline.com/markets/gold/gold-price-today-in-mumbai-chennai-ahmedabad-delhi-hyderabad-bengaluru-kolkata-gold-rates-may-20-2025/article69597232.ece"
    },
    {
        "title": "ELIAS FERRER: Only Trump Can Stop China From Taking Over Venezuela",
        "description": "America’s enemies are gaining ground in the Western Hemisphere, and Washington has been asleep at the wheel. Venezuela is sliding toward the CCP.",
        "content": "America’s enemies are gaining ground in the Western Hemisphere, and Washington has been asleep at the wheel. Venezuela is sliding deeper into the grip of the Chinese Communist Party. It’s not because… [+4476 chars]",
        "published_at": "2025-05-20T11:02:25Z",
        "source": "The Daily Caller",
        "url": "https://dailycaller.com/2025/05/20/opinion-only-trump-can-stop-china-from-taking-over-venezuela-elias-ferrer/"
    },
    {
        "title": "Fidelity, Ark Funds Pull In $343M As Bitcoin ETF Flows Spike",
        "description": "Bitcoin ETFs saw their best day of trading since the start of May, with Fidelity and Ark's funds accounting for more than half of inflows.",
        "content": "In brief\r\n<ul><li>Bitcoin ETFs saw their best day of trading since May 2 on Monday.</li><li>Fidelity's Wise Origin Bitcoin Fund and the ARK 21Shares Bitcoin ETF accounted for more than half of inflow… [+2962 chars]",
        "published_at": "2025-05-20T10:59:28Z",
        "source": "Decrypt",
        "url": "https://decrypt.co/321026/fidelity-ark-funds-pull-in-343m-as-bitcoin-etf-flows-spike"
    },
    {
        "title": "Northern Star completes $192m on-market share buyback",
        "description": "The initiative is part of Northern Star's strategic approach to capital allocation, aimed at maximising shareholder value.",
        "content": "Australian gold mining company Northern Star Resources has announced the completion of its inaugural on-market share buyback programme, valued at A$300m ($192m).\r\nThe programme, which began on 15 Sep… [+2135 chars]",
        "published_at": "2025-05-20T10:58:23Z",
        "source": "Mining Technology",
        "url": "https://www.mining-technology.com/news/northern-star-resources-buy-back/"
    },
    {
        "title": "Best Crypto to Buy as JPMorgan Embraces Bitcoin and Bull Market Returns",
        "description": "Bitcoin just got a surprising nod – from Jamie Dimon of all people. That’s right, the CEO of JPMorgan, one of Bitcoin’s loudest critics over the years, now says his bank will allow clients to buy the cryptocurrency. While JPM won’t hold the coins itself, it’s…",
        "content": "Bitcoin just got a surprising nod from Jamie Dimon of all people.\r\nThats right, the CEO of JPMorgan, one of Bitcoins loudest critics over the years, now says his bank will allow clients to buy the cr… [+6229 chars]",
        "published_at": "2025-05-20T10:53:43Z",
        "source": "Bitcoinist",
        "url": "https://bitcoinist.com/best-crypto-to-buy-as-jpmorgan-embraces-bitcoin-and-bull-market-returns/"
    },
    {
        "title": "“The Money Trust”: “Creation of the Federal Reserve”. Richard C. cook",
        "description": "Serialization of selections from my book Our Country, Then and Now continues with the cooperation of my publisher, Clarity Press. Today we have the third installment of Chapter 9, “The Money Trust”: “The Creation of the Federal Reserve” — Part …\nThe post “The…",
        "content": "Serialization of selections from my book Our Country, Then and Nowcontinues with the cooperation of my publisher, Clarity Press. Today we have the third installment of Chapter 9, The Money Trust: The… [+16018 chars]",
        "published_at": "2025-05-20T10:52:28Z",
        "source": "Globalresearch.ca",
        "url": "https://www.globalresearch.ca/money-trust-part-3-creation-federal-reserve/5887693"
    },
    {
        "title": "Bitcoin's Price Just Passed $100,000. Here's What Might Happen Next",
        "description": "In This Article:\nKey Points\n-\nEconomic pressures may stop Bitcoin from setting a new high in the short term.\n-\nBitcoin behaves more like a tech stock than digital gold right now.\n-\nAdoption will be crucial for long-term success, whether as a store of value or…",
        "content": "In This Article:Key Points-Economic pressures may stop Bitcoin from setting a new high in the short term.-Bitcoin behaves more like a tech stock than digital gold right now.-Adoption will be crucial … [+140 chars]",
        "published_at": "2025-05-20T10:50:02Z",
        "source": "Biztoc.com",
        "url": "https://biztoc.com/x/a86e8ad0cad09253"
    },
    {
        "title": "ASRock X870E Taichi OCF With 25 110A VRM Design Unleashed, X870 Taichi Creator & Nova Also Land",
        "description": "ASRock is introducing several new motherboards at Computex in the AMD AM5 family with the X870E Taichi OCF taking the spotlight at their booth. ASRock Brings Taichi OCF To AMD AM5 Ecosystem With X870E Taichi OCF, Packs 25 VRM Design With 110A SPS Stages & Ext…",
        "content": "ASRock is introducing several new motherboards at Computex in the AMD AM5 family with the X870E Taichi OCF taking the spotlight at their booth.\r\nASRock's Taichi OCF series are some of the fastest and… [+2825 chars]",
        "published_at": "2025-05-20T10:35:37Z",
        "source": "Wccftech",
        "url": "https://wccftech.com/asrock-x870e-taichi-ocf-25-110a-vrm-x870-taichi-creator-nova-also-land/"
    },
    {
        "title": "Calibre Releases 2024 Sustainability Report, Reaffirming Commitment to Responsible Growth and Stakeholder Value",
        "description": "VANCOUVER, British Columbia, May 20, 2025 (GLOBE NEWSWIRE) -- Calibre Mining Corp. (TSX: CXB; OTCQX: CXBMF) (the \"Company\" or \"Calibre\") is pleased to announce the publication of its fifth annual Sustainability Report\r\n, highlighting another year of strong ec…",
        "content": "VANCOUVER, British Columbia, May 20, 2025 (GLOBE NEWSWIRE) -- Calibre Mining Corp. (TSX: CXB; OTCQX: CXBMF) (the \"Company\" or \"Calibre\") is pleased to announce the publication of its fifth annual Sus… [+9721 chars]",
        "published_at": "2025-05-20T10:30:00Z",
        "source": "GlobeNewswire",
        "url": "https://www.globenewswire.com/news-release/2025/05/20/3084663/0/en/Calibre-Releases-2024-Sustainability-Report-Reaffirming-Commitment-to-Responsible-Growth-and-Stakeholder-Value.html"
    },
    {
        "title": "UK’s Legal Aid Agency discloses a data breach following April cyber attack",
        "description": "The UK’s Legal Aid Agency suffered a cyberattack in April and has now confirmed that sensitive data was stolen during the incident. The Legal Aid Agency (LAA) revealed that it had suffered a cyberattack on its systems on April 23.  The Legal Aid Agency (LAA),…",
        "content": "UKs Legal Aid Agency discloses a data breach following April cyber attack\r\n | Sarcoma Ransomware Unveiled: Anatomy of a Double Extortion Gang\r\n | Mozilla fixed zero-days recently demonstrated at Pwn2… [+165898 chars]",
        "published_at": "2025-05-20T09:44:39Z",
        "source": "Securityaffairs.com",
        "url": "https://securityaffairs.com/178088/data-breach/uks-legal-aid-agency-discloses-data-breach-following-april-cyber-attack.html"
    },
    {
        "title": "Best Indoor Antenna 2025: BroadWave HD TV Antenna Review For Rural Reception & Signal Boost",
        "description": "Discover the Best Indoor Antenna 2025 for rural areas. Read our BroadWave HD TV Antenna review and see how it boosts TV signal strength, channel access & HD clarity. Discover the Best Indoor Antenna 2025 for rural areas. Read our BroadWave HD TV Antenna revie…",
        "content": "New York City, May 20, 2025 (GLOBE NEWSWIRE) -- Introduction - Best Indoor Antenna For HD TV\r\nIn an age dominated by streaming platforms and digital subscriptions, the value of local TV channels hasn… [+24358 chars]",
        "published_at": "2025-05-20T09:21:00Z",
        "source": "GlobeNewswire",
        "url": "https://www.globenewswire.com/news-release/2025/05/20/3084615/0/en/Best-Indoor-Antenna-2025-BroadWave-HD-TV-Antenna-Review-For-Rural-Reception-Signal-Boost.html"
    },
    {
        "title": "Bitcoin price aligns with its 130 billion ‘life years’ of attention compared to gold",
        "description": "The pseudonymous co-founder of ScimitarCapital, Thiccy, shared a novel theory on Bitcoin price appreciation Tuesday by comparing Bitcoin’s global attention to that of gold. What gives Bitcoin value? A new way to think about it He argues that gold is valuable …",
        "content": "The pseudonymous co-founder of ScimitarCapital, Thiccy, shared a novel theory on Bitcoin price appreciation Tuesday by comparing Bitcoin’s global attention to that of gold.\r\nHe argues that gold is va… [+2722 chars]",
        "published_at": "2025-05-20T09:12:55Z",
        "source": "CryptoSlate",
        "url": "https://cryptoslate.com/insights/bitcoin-price-aligns-with-its-130-billion-life-years-of-attention-compared-to-gold/"
    },
    {
        "title": "Janus Henderson Group PLC Has $3.84 Million Stake in Royal Gold, Inc. (NASDAQ:RGLD)",
        "description": "Janus Henderson Group PLC lowered its position in Royal Gold, Inc. (NASDAQ:RGLD – Free Report) (TSE:RGL) by 52.7% during the fourth quarter, according to its most recent Form 13F filing with the SEC. The fund owned 29,107 shares of the basic materials company…",
        "content": "Janus Henderson Group PLC lowered its position in Royal Gold, Inc. (NASDAQ:RGLD – Free Report) (TSE:RGL) by 52.7% during the fourth quarter, according to its most recent Form 13F filing with the SEC.… [+5577 chars]",
        "published_at": "2025-05-20T08:24:57Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/janus-henderson-group-plc-has-3-84-million-stake-in-royal-gold-inc-nasdaqrgld/"
    },
    {
        "title": "Graham Capital Management L.P. Acquires New Stake in New Gold Inc. (NYSE:NGD)",
        "description": "Graham Capital Management L.P. acquired a new stake in shares of New Gold Inc. (NYSE:NGD – Free Report) in the fourth quarter, according to the company in its most recent 13F filing with the SEC. The fund acquired 63,955 shares of the company’s stock, valued …",
        "content": "Graham Capital Management L.P. acquired a new stake in shares of New Gold Inc. (NYSE:NGD – Free Report) in the fourth quarter, according to the company in its most recent 13F filing with the SEC. The… [+3796 chars]",
        "published_at": "2025-05-20T08:24:55Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/graham-capital-management-l-p-acquires-new-stake-in-new-gold-inc-nysengd/"
    },
    {
        "title": "Promising Cryptocurrency Stocks To Follow Now – May 17th",
        "description": "Robinhood Markets, Bitdeer Technologies Group, and HIVE Digital Technologies are the three Cryptocurrency stocks to watch today, according to MarketBeat’s stock screener tool. Cryptocurrency stocks are shares of publicly traded companies that develop, mine, t…",
        "content": "Robinhood Markets, Bitdeer Technologies Group, and HIVE Digital Technologies are the three Cryptocurrency stocks to watch today, according to MarketBeat’s stock screener tool. Cryptocurrency stocks a… [+3537 chars]",
        "published_at": "2025-05-20T08:22:51Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/promising-cryptocurrency-stocks-to-follow-now-may-17th/"
    },
    {
        "title": "What is Cormark’s Forecast for CVE:ITR FY2027 Earnings?",
        "description": "Integra Resources Corp. (CVE:ITR – Free Report) – Investment analysts at Cormark issued their FY2027 earnings estimates for Integra Resources in a report released on Friday, May 16th. Cormark analyst R. Gray forecasts that the company will post earnings of $0…",
        "content": "Integra Resources Corp. (CVE:ITR – Free Report) – Investment analysts at Cormark issued their FY2027 earnings estimates for Integra Resources in a report released on Friday, May 16th. Cormark analyst… [+1750 chars]",
        "published_at": "2025-05-20T08:14:50Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/what-is-cormarks-forecast-for-cveitr-fy2027-earnings/"
    },
    {
        "title": "Deutsche Bank AG Has $3.79 Million Stock Position in Fortuna Silver Mines Inc. (NYSE:FSM)",
        "description": "Deutsche Bank AG lifted its holdings in shares of Fortuna Silver Mines Inc. (NYSE:FSM – Free Report) (TSE:FVI) by 2.4% during the fourth quarter, according to the company in its most recent Form 13F filing with the SEC. The firm owned 883,993 shares of the ba…",
        "content": "Deutsche Bank AG lifted its holdings in shares of Fortuna Silver Mines Inc. (NYSE:FSM – Free Report) (TSE:FVI) by 2.4% during the fourth quarter, according to the company in its most recent Form 13F … [+4747 chars]",
        "published_at": "2025-05-20T08:12:53Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/deutsche-bank-ag-has-3-79-million-stock-position-in-fortuna-silver-mines-inc-nysefsm/"
    },
    {
        "title": "Graham Capital Management L.P. Invests $135,000 in Skeena Resources Limited (NYSE:SKE)",
        "description": "Graham Capital Management L.P. acquired a new position in shares of Skeena Resources Limited (NYSE:SKE – Free Report) during the 4th quarter, HoldingsChannel.com reports. The fund acquired 15,476 shares of the company’s stock, valued at approximately $135,000…",
        "content": "Graham Capital Management L.P. acquired a new position in shares of Skeena Resources Limited (NYSE:SKE – Free Report) during the 4th quarter, HoldingsChannel.com reports. The fund acquired 15,476 sha… [+3161 chars]",
        "published_at": "2025-05-20T08:10:55Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/graham-capital-management-l-p-invests-135000-in-skeena-resources-limited-nyseske/"
    },
    {
        "title": "Graham Capital Management L.P. Sells 135,325 Shares of First Majestic Silver Corp. (NYSE:AG)",
        "description": "Graham Capital Management L.P. lowered its position in shares of First Majestic Silver Corp. (NYSE:AG – Free Report) (TSE:FR) by 83.3% during the fourth quarter, according to its most recent disclosure with the Securities and Exchange Commission. The fund own…",
        "content": "Graham Capital Management L.P. lowered its position in shares of First Majestic Silver Corp. (NYSE:AG – Free Report) (TSE:FR) by 83.3% during the fourth quarter, according to its most recent disclosu… [+5095 chars]",
        "published_at": "2025-05-20T08:10:54Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/graham-capital-management-l-p-sells-135325-shares-of-first-majestic-silver-corp-nyseag/"
    },
    {
        "title": "Graham Capital Management L.P. Invests $177,000 in IAMGOLD Co. (NYSE:IAG)",
        "description": "Graham Capital Management L.P. purchased a new position in shares of IAMGOLD Co. (NYSE:IAG – Free Report) (TSE:IMG) in the 4th quarter, according to the company in its most recent filing with the SEC. The fund purchased 34,263 shares of the mining company’s s…",
        "content": "Graham Capital Management L.P. purchased a new position in shares of IAMGOLD Co. (NYSE:IAG – Free Report) (TSE:IMG) in the 4th quarter, according to the company in its most recent filing with the SEC… [+4176 chars]",
        "published_at": "2025-05-20T08:09:23Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/graham-capital-management-l-p-invests-177000-in-iamgold-co-nyseiag/"
    },
    {
        "title": "Gotham Asset Management LLC Buys 41,778 Shares of Coeur Mining, Inc. (NYSE:CDE)",
        "description": "Gotham Asset Management LLC boosted its stake in shares of Coeur Mining, Inc. (NYSE:CDE – Free Report) by 119.8% in the fourth quarter, according to its most recent disclosure with the Securities & Exchange Commission. The firm owned 76,637 shares of the basi…",
        "content": "Gotham Asset Management LLC boosted its stake in shares of Coeur Mining, Inc. (NYSE:CDE – Free Report) by 119.8% in the fourth quarter, according to its most recent disclosure with the Securities &am… [+6042 chars]",
        "published_at": "2025-05-20T08:07:02Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/gotham-asset-management-llc-buys-41778-shares-of-coeur-mining-inc-nysecde/"
    },
    {
        "title": "SilverCrest Metals Inc. (NYSE:SILV) Stake Lowered by Gotham Asset Management LLC",
        "description": "Gotham Asset Management LLC reduced its stake in shares of SilverCrest Metals Inc. (NYSE:SILV – Free Report) by 3.9% during the 4th quarter, according to the company in its most recent filing with the Securities & Exchange Commission. The institutional invest…",
        "content": "Gotham Asset Management LLC reduced its stake in shares of SilverCrest Metals Inc. (NYSE:SILV – Free Report) by 3.9% during the 4th quarter, according to the company in its most recent filing with th… [+3048 chars]",
        "published_at": "2025-05-20T08:07:02Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/silvercrest-metals-inc-nysesilv-stake-lowered-by-gotham-asset-management-llc/"
    },
    {
        "title": "Gotham Asset Management LLC Increases Stake in Sandstorm Gold Ltd. (NYSE:SAND)",
        "description": "Gotham Asset Management LLC increased its position in Sandstorm Gold Ltd. (NYSE:SAND – Free Report) by 192.9% in the 4th quarter, according to the company in its most recent filing with the SEC. The fund owned 83,192 shares of the company’s stock after acquir…",
        "content": "Gotham Asset Management LLC increased its position in Sandstorm Gold Ltd. (NYSE:SAND – Free Report) by 192.9% in the 4th quarter, according to the company in its most recent filing with the SEC. The … [+4820 chars]",
        "published_at": "2025-05-20T08:06:52Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/gotham-asset-management-llc-increases-stake-in-sandstorm-gold-ltd-nysesand/"
    },
    {
        "title": "Signature Aviation Announces Global Expansion of BRAVO Program for Small and Medium-Sized Private Aviation Operators",
        "description": "Network expansion of industry leading program brings valuable benefits, increased accessibility, and elevated experiences to the global market. Orlando, FL, May 20, 2025 (GLOBE NEWSWIRE) — Signature Aviation, the world’s largest network of private aviation te…",
        "content": "Network expansion of industry leading program brings valuable benefits, increased accessibility, and elevated experiences to the global market.\r\nTHIS CONTENT IS RESERVED FOR SUBSCRIBERS ONLY\r\nSubscri… [+5396 chars]",
        "published_at": "2025-05-20T08:03:37Z",
        "source": "Financial Post",
        "url": "https://financialpost.com/globe-newswire/signature-aviation-announces-global-expansion-of-bravo-program-for-small-and-medium-sized-private-aviation-operators"
    },
    {
        "title": "Ariana Resources (LON:AAU) Stock Price Passes Below Two Hundred Day Moving Average – What’s Next?",
        "description": "Ariana Resources plc (LON:AAU – Get Free Report)’s share price passed below its 200-day moving average during trading on Monday . The stock has a 200-day moving average of GBX 1.82 ($0.02) and traded as low as GBX 1.18 ($0.02). Ariana Resources shares last tr…",
        "content": "Ariana Resources plc (LON:AAU – Get Free Report)’s share price passed below its 200-day moving average during trading on Monday . The stock has a 200-day moving average of GBX 1.82 ($0.02) and traded… [+1575 chars]",
        "published_at": "2025-05-20T08:01:10Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/ariana-resources-lonaau-stock-price-passes-below-two-hundred-day-moving-average-whats-next/"
    },
    {
        "title": "Collective Mining (TSE:CNL) Stock Price Passes Above Two Hundred Day Moving Average – Should You Sell?",
        "description": "Collective Mining Ltd. (TSE:CNL – Get Free Report) passed above its 200-day moving average during trading on Monday . The stock has a 200-day moving average of C$8.66 and traded as high as C$13.56. Collective Mining shares last traded at C$13.54, with a volum…",
        "content": "Collective Mining Ltd. (TSE:CNL – Get Free Report) passed above its 200-day moving average during trading on Monday . The stock has a 200-day moving average of C$8.66 and traded as high as C$13.56. C… [+1452 chars]",
        "published_at": "2025-05-20T08:00:59Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/collective-mining-tsecnl-stock-price-passes-above-two-hundred-day-moving-average-should-you-sell/"
    },
    {
        "title": "Signature Aviation Announces Global Expansion of BRAVO Program for Small and Medium-Sized Private Aviation Operators",
        "description": "Network expansion of industry leading program brings valuable benefits, increased accessibility, and elevated experiences to the global market. Network expansion of industry leading program brings valuable benefits, increased accessibility, and elevated exper…",
        "content": "Orlando, FL, May 20, 2025 (GLOBE NEWSWIRE) -- Signature Aviation, the worlds largest network of private aviation terminals, is expanding BRAVO by Signature to include benefits across its global netwo… [+3930 chars]",
        "published_at": "2025-05-20T08:00:00Z",
        "source": "GlobeNewswire",
        "url": "https://www.globenewswire.com/news-release/2025/05/20/3084569/0/en/Signature-Aviation-Announces-Global-Expansion-of-BRAVO-Program-for-Small-and-Medium-Sized-Private-Aviation-Operators.html"
    },
    {
        "title": "BHP Group Limited (NYSE:BHP) Stake Boosted by Focus Partners Wealth",
        "description": "Focus Partners Wealth lifted its holdings in shares of BHP Group Limited (NYSE:BHP – Free Report) by 37.5% in the 4th quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The firm owned 12,002 shares of …",
        "content": "Focus Partners Wealth lifted its holdings in shares of BHP Group Limited (NYSE:BHP – Free Report) by 37.5% in the 4th quarter, according to the company in its most recent disclosure with the Securiti… [+4177 chars]",
        "published_at": "2025-05-20T07:55:00Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/bhp-group-limited-nysebhp-stake-boosted-by-focus-partners-wealth/"
    },
    {
        "title": "Barrick Gold Corp (NYSE:B) Shares Acquired by Focus Partners Wealth",
        "description": "Focus Partners Wealth grew its holdings in Barrick Gold Corp (NYSE:B – Free Report) (TSE:ABX) by 40.8% during the 4th quarter, according to the company in its most recent 13F filing with the Securities & Exchange Commission. The fund owned 44,211 shares of th…",
        "content": "Focus Partners Wealth grew its holdings in Barrick Gold Corp (NYSE:B – Free Report) (TSE:ABX) by 40.8% during the 4th quarter, according to the company in its most recent 13F filing with the Securiti… [+5379 chars]",
        "published_at": "2025-05-20T07:54:57Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/barrick-gold-corp-nyseb-shares-acquired-by-focus-partners-wealth/"
    },
    {
        "title": "Bitcoin and Gold in Sweet Spot as Bond Market 'Smackdown' Exposes the U.S. Fiscal Kayfabe: Godbole",
        "description": "Bond markets are challenging the illusion of U.S. fiscal stability and safe have status. BTC and gold stand to gain.",
        "content": "There is a popular saying, that goes, \"If you want to understand America, watch a pro wrestling match.\" Though it may be glib and a little over simplified, it appears to 'ring' true, as the U.S. fina… [+6948 chars]",
        "published_at": "2025-05-20T07:52:52Z",
        "source": "CoinDesk",
        "url": "https://www.coindesk.com/markets/2025/05/20/bitcoin-and-gold-in-sweet-spot-as-bond-markets-expose-the-u-s-fiscal-kayfabe-omkar-godbole"
    },
    {
        "title": "Brookfield Asset Management Ltd. (NYSE:BAM) Shares Sold by Captrust Financial Advisors",
        "description": "Captrust Financial Advisors lessened its holdings in shares of Brookfield Asset Management Ltd. (NYSE:BAM – Free Report) (TSE:BAM.A) by 5.1% during the 4th quarter, HoldingsChannel reports. The firm owned 8,061 shares of the financial services provider’s stoc…",
        "content": "Captrust Financial Advisors lessened its holdings in shares of Brookfield Asset Management Ltd. (NYSE:BAM – Free Report) (TSE:BAM.A) by 5.1% during the 4th quarter, HoldingsChannel reports. The firm … [+5568 chars]",
        "published_at": "2025-05-20T07:52:45Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/brookfield-asset-management-ltd-nysebam-shares-sold-by-captrust-financial-advisors/"
    },
    {
        "title": "When theatres became temples, and a movie became a marvel",
        "description": "Times Special News: In the summer of 1975, filmgoers in Arrah, a small town in central Bihar, would often witness an unlikely spectacle outside their local Sapna cinema.",
        "content": "<ul><li>News</li>\r\n<li>When theatres became temples, and a movie became a marvel</li></ul>\r\nFollow Us On Social Media\r\nGulzar Houz fire: 6-member IAS-IPS panel set up to probe blaze that killed 17, s… [+1443 chars]",
        "published_at": "2025-05-20T07:43:13Z",
        "source": "The Times of India",
        "url": "https://timesofindia.indiatimes.com/times-special/when-theatres-became-temples-and-a-movie-became-a-marvel/articleshow/121285865.cms"
    },
    {
        "title": "Lundin Mining (TSE:LUN) Stock Price Crosses Above 200-Day Moving Average – Time to Sell?",
        "description": "Lundin Mining Co. (TSE:LUN – Get Free Report) passed above its 200-day moving average during trading on Monday . The stock has a 200-day moving average of C$12.31 and traded as high as C$12.63. Lundin Mining shares last traded at C$12.31, with a volume of 2,6…",
        "content": "Lundin Mining Co. (TSE:LUN – Get Free Report) passed above its 200-day moving average during trading on Monday . The stock has a 200-day moving average of C$12.31 and traded as high as C$12.63. Lundi… [+2921 chars]",
        "published_at": "2025-05-20T07:42:52Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/lundin-mining-tselun-stock-price-crosses-above-200-day-moving-average-time-to-sell/"
    },
    {
        "title": "Sarcoma Ransomware Unveiled: Anatomy of a Double Extortion Gang",
        "description": "Cybersecurity Observatory of the Unipegaso’s malware lab published a detailed analysis of the Sarcoma ransomware. It is with great pleasure and honor that I present the first report produced by the Malware Analysis Lab, led by Luigi Martire. The lab was estab…",
        "content": "Sarcoma Ransomware Unveiled: Anatomy of a Double Extortion Gang\r\n | Mozilla fixed zero-days recently demonstrated at Pwn2Own Berlin 2025\r\n | Japan passed a law allowing preemptive offensive cyber act… [+165820 chars]",
        "published_at": "2025-05-20T07:37:53Z",
        "source": "Securityaffairs.com",
        "url": "https://securityaffairs.com/178072/malware/sarcoma-ransomware-unveiled-anatomy-of-a-double-extortion-gang.html"
    },
    {
        "title": "LTD EC-201 Electric Guitar Black Satin - Today's Price $349.0 - Reg $599.0",
        "description": "Get the guaranteed best price on Solid Body Electric Guitars like the ESP LTD EC-201 Electric Guitar at Musician's Friend. Get a low price and free shipping on thousands of items.",
        "content": "Gold Coverage goes above and beyond the manufacturer's warranty to protect your gear from unexpected\r\nbreakdowns, accidental damage from handling\r\nand failures. This plan covers your product for one,… [+1138 chars]",
        "published_at": "2025-05-20T07:30:00Z",
        "source": "Musiciansfriend.com",
        "url": "https://www.musiciansfriend.com/guitars/esp-ltd-ec-201-electric-guitar/l92606000001000"
    },
    {
        "title": "Elevate Your Ride: A Guide to Golf Cart Paint Schemes",
        "description": "Why Paint Matters: The Benefits of a Fresh Look Boosting Appearance and Curb Appeal The initial appeal of any golf […]\nThe post Elevate Your Ride: A Guide to Golf Cart Paint Schemes appeared first on Things You Ought to Know.",
        "content": "Why Paint Matters: The Benefits of a Fresh Look\r\nBoosting Appearance and Curb Appeal\r\nThe initial appeal of any golf cart, whether new or used, often lies in its appearance. That gleaming exterior is… [+11853 chars]",
        "published_at": "2025-05-20T07:29:44Z",
        "source": "Ie.edu",
        "url": "https://entrepreneurship.blogs.ie.edu/elevate-your-ride-a-guide-to-golf-cart-paint-schemes/"
    },
    {
        "title": "Bank of America Corp DE Purchases 2,504,157 Shares of New Gold Inc. (NYSE:NGD)",
        "description": "Bank of America Corp DE raised its stake in New Gold Inc. (NYSE:NGD – Free Report) by 46.2% during the 4th quarter, according to the company in its most recent 13F filing with the Securities & Exchange Commission. The firm owned 7,925,231 shares of the compan…",
        "content": "Bank of America Corp DE raised its stake in New Gold Inc. (NYSE:NGD – Free Report) by 46.2% during the 4th quarter, according to the company in its most recent 13F filing with the Securities &amp; Ex… [+4001 chars]",
        "published_at": "2025-05-20T07:20:59Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/bank-of-america-corp-de-purchases-2504157-shares-of-new-gold-inc-nysengd/"
    },
    {
        "title": "Agnico Eagle Mines Limited (TSE:AEM) Receives Average Rating of “Buy” from Brokerages",
        "description": "Shares of Agnico Eagle Mines Limited (TSE:AEM – Get Free Report) (NYSE:AEM) have been assigned an average rating of “Buy” from the eight analysts that are currently covering the company, Marketbeat Ratings reports. One research analyst has rated the stock wit…",
        "content": "Shares of Agnico Eagle Mines Limited (TSE:AEM – Get Free Report) (NYSE:AEM) have been assigned an average rating of “Buy” from the eight analysts that are currently covering the company, Marketbeat R… [+3302 chars]",
        "published_at": "2025-05-20T07:12:59Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/agnico-eagle-mines-limited-tseaem-receives-average-rating-of-buy-from-brokerages/"
    },
    {
        "title": "Northern Trust Corp Acquires Shares of 314,658 AngloGold Ashanti plc (NYSE:AU)",
        "description": "Northern Trust Corp acquired a new stake in AngloGold Ashanti plc (NYSE:AU – Free Report) during the fourth quarter, Holdings Channel.com reports. The firm acquired 314,658 shares of the mining company’s stock, valued at approximately $7,262,000. Other instit…",
        "content": "Northern Trust Corp acquired a new stake in AngloGold Ashanti plc (NYSE:AU – Free Report) during the fourth quarter, Holdings Channel.com reports. The firm acquired 314,658 shares of the mining compa… [+4352 chars]",
        "published_at": "2025-05-20T07:08:54Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/northern-trust-corp-acquires-shares-of-314658-anglogold-ashanti-plc-nyseau/"
    },
    {
        "title": "Hands-On: Casio G-Shock GMC-B2100ZE-1A 50th-Anniversary Watch",
        "description": "Technically speaking, last year marked the official 50th anniversary of the first Casio watch. However, the Japanese manufacturer’s celebrations have spilled over into 2025 with a commemorative version of its G-Shock 2100 series full-metal chronograph. Inspir…",
        "content": "Technically speaking, last year marked the official 50th anniversary of the first Casio watch. However, the Japanese manufacturers celebrations have spilled over into 2025 with a commemorative versio… [+8362 chars]",
        "published_at": "2025-05-20T07:01:55Z",
        "source": "aBlogtoWatch",
        "url": "https://www.ablogtowatch.com/hands-on-casio-g-shock-gmc-b2100ze-1a-50th-anniversary-watch/"
    },
    {
        "title": "Artemis Gold (OTCMKTS:ARGTF) Stock Price Up 2.1% – What’s Next?",
        "description": "Shares of Artemis Gold Inc. (OTCMKTS:ARGTF – Get Free Report) were up 2.1% during trading on Monday . The company traded as high as $14.63 and last traded at $14.55. Approximately 6,101 shares traded hands during trading, a decline of 79% from the average dai…",
        "content": "Shares of Artemis Gold Inc. (OTCMKTS:ARGTF – Get Free Report) were up 2.1% during trading on Monday . The company traded as high as $14.63 and last traded at $14.55. Approximately 6,101 shares traded… [+1360 chars]",
        "published_at": "2025-05-20T06:54:51Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/artemis-gold-otcmktsargtf-stock-price-up-2-1-whats-next/"
    },
    {
        "title": "Brokerages Set Newmont Co. (NYSE:NEM) Target Price at $56.52",
        "description": "Newmont Co. (NYSE:NEM – Get Free Report) has been given an average recommendation of “Moderate Buy” by the nineteen analysts that are presently covering the company, Marketbeat Ratings reports. One analyst has rated the stock with a sell rating, seven have is…",
        "content": "Newmont Co. (NYSE:NEM – Get Free Report) has been given an average recommendation of “Moderate Buy” by the nineteen analysts that are presently covering the company, Marketbeat Ratings reports. One a… [+5523 chars]",
        "published_at": "2025-05-20T06:52:51Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/brokerages-set-newmont-co-nysenem-target-price-at-56-52/"
    },
    {
        "title": "Desjardins Predicts Integra Resources FY2025 Earnings",
        "description": "Integra Resources Corp. (NYSEAMERICAN:ITRG – Free Report) – Stock analysts at Desjardins issued their FY2025 earnings estimates for shares of Integra Resources in a research note issued to investors on Wednesday, May 14th. Desjardins analyst A. Carson expects…",
        "content": "Integra Resources Corp. (NYSEAMERICAN:ITRG – Free Report) – Stock analysts at Desjardins issued their FY2025 earnings estimates for shares of Integra Resources in a research note issued to investors … [+3029 chars]",
        "published_at": "2025-05-20T06:39:03Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/desjardins-predicts-integra-resources-fy2025-earnings/"
    },
    {
        "title": "Dynacor Group FY2025 EPS Forecast Lowered by Atrium Research",
        "description": "Dynacor Group Inc. (TSE:DNG – Free Report) – Stock analysts at Atrium Research reduced their FY2025 earnings per share (EPS) estimates for shares of Dynacor Group in a report issued on Thursday, May 15th. Atrium Research analyst B. Pirie now forecasts that th…",
        "content": "Dynacor Group Inc. (TSE:DNG – Free Report) – Stock analysts at Atrium Research reduced their FY2025 earnings per share (EPS) estimates for shares of Dynacor Group in a report issued on Thursday, May … [+1845 chars]",
        "published_at": "2025-05-20T06:39:02Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/dynacor-group-fy2025-eps-forecast-lowered-by-atrium-research/"
    },
    {
        "title": "FY2025 EPS Estimates for TSE:ASM Raised by HC Wainwright",
        "description": "Avino Silver & Gold Mines Ltd. (TSE:ASM – Free Report) – Investment analysts at HC Wainwright boosted their FY2025 EPS estimates for Avino Silver & Gold Mines in a report issued on Thursday, May 15th. HC Wainwright analyst H. Ihle now expects that the company…",
        "content": "Avino Silver &amp; Gold Mines Ltd. (TSE:ASM – Free Report) – Investment analysts at HC Wainwright boosted their FY2025 EPS estimates for Avino Silver &amp; Gold Mines in a report issued on Thursday, … [+1635 chars]",
        "published_at": "2025-05-20T06:39:02Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/fy2025-eps-estimates-for-tseasm-raised-by-hc-wainwright/"
    },
    {
        "title": "FY2025 EPS Estimates for Altius Minerals Lifted by Analyst",
        "description": "Altius Minerals Co. (TSE:ALS – Free Report) – Research analysts at National Bank Financial lifted their FY2025 EPS estimates for shares of Altius Minerals in a report released on Wednesday, May 14th. National Bank Financial analyst S. Nagle now expects that t…",
        "content": "Altius Minerals Co. (TSE:ALS – Free Report) – Research analysts at National Bank Financial lifted their FY2025 EPS estimates for shares of Altius Minerals in a report released on Wednesday, May 14th.… [+2083 chars]",
        "published_at": "2025-05-20T06:39:00Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/fy2025-eps-estimates-for-altius-minerals-lifted-by-analyst/"
    },
    {
        "title": "HC Wainwright Cuts Earnings Estimates for Integra Resources",
        "description": "Integra Resources Corp. (NYSEAMERICAN:ITRG – Free Report) – Stock analysts at HC Wainwright reduced their FY2025 EPS estimates for shares of Integra Resources in a research report issued on Thursday, May 15th. HC Wainwright analyst H. Ihle now expects that th…",
        "content": "Integra Resources Corp. (NYSEAMERICAN:ITRG – Free Report) – Stock analysts at HC Wainwright reduced their FY2025 EPS estimates for shares of Integra Resources in a research report issued on Thursday,… [+2537 chars]",
        "published_at": "2025-05-20T06:38:56Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/hc-wainwright-cuts-earnings-estimates-for-integra-resources/"
    },
    {
        "title": "The Shocking Decline of Roomba: How iRobot Lost Its Edge",
        "description": "What happens when a company that once defined an industry begins to lose its edge? For years, iRobot’s Roomba was the gold standard in robotic vacuums, a household name synonymous with convenience and innovative technology. Yet, the brand that once commanded …",
        "content": "What happens when a company that once defined an industry begins to lose its edge? For years, iRobots Roomba was the gold standard in robotic vacuums, a household name synonymous with convenience and… [+7831 chars]",
        "published_at": "2025-05-20T06:38:42Z",
        "source": "Geeky Gadgets",
        "url": "https://www.geeky-gadgets.com/irobot-roomba-market-decline/"
    },
    {
        "title": "Brokers Offer Predictions for Barrick Gold FY2025 Earnings",
        "description": "Barrick Gold Corp (NYSE:B – Free Report) (TSE:ABX) – Stock analysts at National Bank Financial lowered their FY2025 earnings per share (EPS) estimates for Barrick Gold in a research note issued to investors on Wednesday, May 14th. National Bank Financial anal…",
        "content": "Barrick Gold Corp (NYSE:B – Free Report) (TSE:ABX) – Stock analysts at National Bank Financial lowered their FY2025 earnings per share (EPS) estimates for Barrick Gold in a research note issued to in… [+5095 chars]",
        "published_at": "2025-05-20T06:37:07Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/brokers-offer-predictions-for-barrick-gold-fy2025-earnings/"
    },
    {
        "title": "Lumina Gold (OTCMKTS:LMGDF) Stock Price Down 0.8% – Here’s What Happened",
        "description": "Shares of Lumina Gold Corp. (OTCMKTS:LMGDF – Get Free Report) traded down 0.8% during trading on Monday . The company traded as low as $0.84 and last traded at $0.85. 25,602 shares traded hands during mid-day trading, a decline of 82% from the average session…",
        "content": "Shares of Lumina Gold Corp. (OTCMKTS:LMGDF – Get Free Report) traded down 0.8% during trading on Monday . The company traded as low as $0.84 and last traded at $0.85. 25,602 shares traded hands durin… [+916 chars]",
        "published_at": "2025-05-20T06:34:55Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/lumina-gold-otcmktslmgdf-stock-price-down-0-8-heres-what-happened/"
    },
    {
        "title": "Gold price stable, minor dip in silver",
        "description": "KATHMANDU: The price of gold in the local market has remained unchanged for the past three days, while silver has witnessed a slight fluctuation. According to the Federation of Nepal Gold and Silver Dealers’ Association, the price of fine gold today stands at…",
        "content": "KATHMANDU: The price of gold in the local market has remained unchanged for the past three days, while silver has witnessed a slight fluctuation.\r\nAccording to the Federation of Nepal Gold and Silver… [+346 chars]",
        "published_at": "2025-05-20T06:20:57Z",
        "source": "Khabarhub.com",
        "url": "https://english.khabarhub.com/2025/20/468884/"
    },
    {
        "title": "FY2025 EPS Forecast for Defiance Silver Boosted by Analyst",
        "description": "Defiance Silver Corp. (CVE:DEF – Free Report) – Equities researchers at Northland Capmk raised their FY2025 earnings estimates for shares of Defiance Silver in a research report issued to clients and investors on Thursday, May 15th. Northland Capmk analyst M.…",
        "content": "Defiance Silver Corp. (CVE:DEF – Free Report) – Equities researchers at Northland Capmk raised their FY2025 earnings estimates for shares of Defiance Silver in a research report issued to clients and… [+1381 chars]",
        "published_at": "2025-05-20T06:20:54Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/fy2025-eps-forecast-for-defiance-silver-boosted-by-analyst/"
    },
    {
        "title": "Analysts Set Expectations for CVE:ITR FY2025 Earnings",
        "description": "Integra Resources Corp. (CVE:ITR – Free Report) – Analysts at Desjardins issued their FY2025 EPS estimates for Integra Resources in a note issued to investors on Wednesday, May 14th. Desjardins analyst A. Carson anticipates that the company will post earnings…",
        "content": "Integra Resources Corp. (CVE:ITR – Free Report) – Analysts at Desjardins issued their FY2025 EPS estimates for Integra Resources in a note issued to investors on Wednesday, May 14th. Desjardins analy… [+1869 chars]",
        "published_at": "2025-05-20T06:20:51Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/analysts-set-expectations-for-cveitr-fy2025-earnings/"
    },
    {
        "title": "Gold Price Prediction: Gold prices off Rs 6,500 from peak. Time to buy now?",
        "description": "Gold futures opened lower at MCX, mirroring international trends, while silver also saw a dip. This decline marks a significant fall from gold's peak, though recent volatility has kept prices largely flat. International markets initially rallied on Moody's US…",
        "content": "Mirroring the sentiment in the international market, Gold June futures contracts at MCX opened lower on Tuesday at Rs 92965/10 grams, which was down by Rs 332 or 0.36%, while silver July futures were… [+3438 chars]",
        "published_at": "2025-05-20T06:05:04Z",
        "source": "The Times of India",
        "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-price-prediction-gold-prices-off-rs-6500-from-peak-time-to-buy-now/articleshow/121284115.cms"
    },
    {
        "title": "Regulus Resources (CVE:REG) Stock Price Up 1.5% – What’s Next?",
        "description": "Regulus Resources Inc. (CVE:REG – Get Free Report) shares shot up 1.5% on Monday . The company traded as high as C$2.04 and last traded at C$1.98. 21,448 shares traded hands during trading, a decline of 38% from the average session volume of 34,867 shares. Th…",
        "content": "Regulus Resources Inc. (CVE:REG – Get Free Report) shares shot up 1.5% on Monday . The company traded as high as C$2.04 and last traded at C$1.98. 21,448 shares traded hands during trading, a decline… [+1008 chars]",
        "published_at": "2025-05-20T05:52:55Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/regulus-resources-cvereg-stock-price-up-1-5-whats-next/"
    },
    {
        "title": "Reviewing First Colombia Gold (OTCMKTS:FCGD) and Gold Resource (NYSE:GORO)",
        "description": "First Colombia Gold (OTCMKTS:FCGD – Get Free Report) and Gold Resource (NYSE:GORO – Get Free Report) are both small-cap basic materials companies, but which is the superior business? We will contrast the two companies based on the strength of their risk, anal…",
        "content": "First Colombia Gold (OTCMKTS:FCGD – Get Free Report) and Gold Resource (NYSE:GORO – Get Free Report) are both small-cap basic materials companies, but which is the superior business? We will contrast… [+4124 chars]",
        "published_at": "2025-05-20T05:46:51Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/reviewing-first-colombia-gold-otcmktsfcgd-and-gold-resource-nysegoro/"
    },
    {
        "title": "Centerra Gold Inc. (TSE:CG) Given Average Recommendation of “Moderate Buy” by Analysts",
        "description": "Shares of Centerra Gold Inc. (TSE:CG – Get Free Report) have been given a consensus rating of “Moderate Buy” by the eight ratings firms that are covering the firm, Marketbeat.com reports. Four analysts have rated the stock with a hold rating, three have assig…",
        "content": "Shares of Centerra Gold Inc. (TSE:CG – Get Free Report) have been given a consensus rating of “Moderate Buy” by the eight ratings firms that are covering the firm, Marketbeat.com reports. Four analys… [+3254 chars]",
        "published_at": "2025-05-20T05:38:59Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/centerra-gold-inc-tsecg-given-average-recommendation-of-moderate-buy-by-analysts/"
    },
    {
        "title": "Transaction in Own Shares",
        "description": "ENDEAVOUR ANNOUNCES TRANSACTION IN OWN SHARES  London, 20 May 2025 – Endeavour Mining plc (LSE:EDV, TSX:EDV) (“the Company”) announces it has......",
        "content": "ENDEAVOUR ANNOUNCES TRANSACTION IN OWN SHARES\r\nLondon, 20 May 2025 Endeavour Mining plc (LSE:EDV, TSX:EDV) (the Company) announces it has purchased the following number of its ordinary shares of USD … [+11912 chars]",
        "published_at": "2025-05-20T05:30:00Z",
        "source": "GlobeNewswire",
        "url": "https://www.globenewswire.com/news-release/2025/05/20/3084518/0/en/Transaction-in-Own-Shares.html"
    },
    {
        "title": "What is Cormark’s Estimate for Capstone Copper Q2 Earnings?",
        "description": "Capstone Copper Corp. (TSE:CS – Free Report) – Equities research analysts at Cormark dropped their Q2 2025 earnings per share estimates for Capstone Copper in a research report issued on Thursday, May 15th. Cormark analyst S. Ioannou now anticipates that the …",
        "content": "Capstone Copper Corp. (TSE:CS – Free Report) – Equities research analysts at Cormark dropped their Q2 2025 earnings per share estimates for Capstone Copper in a research report issued on Thursday, Ma… [+2658 chars]",
        "published_at": "2025-05-20T05:17:14Z",
        "source": "ETF Daily News",
        "url": "https://www.etfdailynews.com/2025/05/20/what-is-cormarks-estimate-for-capstone-copper-q2-earnings/"
    },
    {
        "title": "ಕೊನೆಗೂ ಬಂಗಾರ ಪ್ರಿಯರ ಕನಸು ನನಸು; ಇಂದು ಚಿನ್ನದ ಬೆಲೆ 4,900 ರೂ ಇಳಿಕೆ",
        "description": "Gold And Silver Price: ಇಂದು ಚಿನ್ನದ ಬೆಲೆಯಲ್ಲಿ ಗಣನೀಯ ಇಳಿಕೆ ಕಂಡುಬಂದಿದೆ. 22 ಮತ್ತು 24 ಕ್ಯಾರಟ್ ಚಿನ್ನದ ದರದಲ್ಲಿ ಕ್ರಮವಾಗಿ 450 ಮತ್ತು 490 ರೂಪಾಯಿ ಇಳಿಕೆಯಾಗಿದೆ. ಬೆಳ್ಳಿ ದರದಲ್ಲಿಯೂ ಇಳಿಕೆ ಕಂಡುಬಂದಿದೆ.",
        "content": "22  \r\n1 : 8,750 8 : 69,680 10 : 87,100 100 : 8,71,000 \r\n24  \r\n1 : 9,502 8 : 76,016 10 : 95,020 100 : 9,50,200 \r\n18  \r\n1 : 7,127 8 : 57,016 10 : 71,270 100 : 7,12,700 \r\n22 10 . : 87,100 , : 87,100 , :… [+149 chars]",
        "published_at": "2025-05-20T04:48:43Z",
        "source": "Asianetnews.com",
        "url": "https://kannada.asianetnews.com/gallery/business/gold-lovers-dream-finally-comes-true-gold-price-drops-by-rs-4900-today-mrq-swjmlu"
    },
    {
        "title": "Adorn Yourself Eternally: Discover Permanent Jewelry in Bel Air MD",
        "description": "The Allure of Permanent Jewelry: A Modern Accessory Are you seeking a fresh way to express your personal style? Tired […]\nThe post Adorn Yourself Eternally: Discover Permanent Jewelry in Bel Air MD appeared first on Things You Ought to Know.",
        "content": "The Allure of Permanent Jewelry: A Modern Accessory\r\nAre you seeking a fresh way to express your personal style? Tired of the constant ritual of clasping and unclasping your jewelry? In the vibrant t… [+10204 chars]",
        "published_at": "2025-05-20T04:02:53Z",
        "source": "Ie.edu",
        "url": "https://entrepreneurship.blogs.ie.edu/adorn-yourself-eternally-discover-permanent-jewelry-in-bel-air-md/"
    },
    {
        "title": "Bitcoin ‘de-correlates’ from gold! – Investors, why is this important",
        "description": "Bitcoin could flip Gold, as confidence continues to grow among investors.",
        "content": "<ul><li>Bitcoin was de-correlating from Gold, as it attracted more liquidity into the market.</li><li>The available Bitcoin in the market has continued to drop, and whale activity has also declined.<… [+2884 chars]",
        "published_at": "2025-05-20T04:00:52Z",
        "source": "Ambcrypto.com",
        "url": "https://ambcrypto.com/bitcoin-de-correlates-from-gold-investors-why-is-this-important/"
    },
    {
        "title": "Critical Role’s Daggerheart TTRPG solves some of D&D’s biggest problems",
        "description": "The popularity of the actual play show Critical Role helped make 5th edition Dungeons & Dragons wildly successful. But now, Critical Role Productions has become more than a booster and frequent collaborator for D&D: It’s become a competitor. After years in de…",
        "content": "The popularity of the actual play show Critical Role helped make 5th edition Dungeons & Dragons wildly successful. But now, Critical Role Productions has become more than a booster and frequent colla… [+6590 chars]",
        "published_at": "2025-05-20T03:50:33Z",
        "source": "Polygon",
        "url": "https://www.polygon.com/critical-role/599974/daggerheart-review-critical-role-ttrpg-rules-overview"
    },
    {
        "title": "Blue Goose Mount Ideas: Elevate Your Waterfowl Trophy Display",
        "description": "The crisp air bites, the sunrise paints the horizon in hues of orange and gold, and your heart pounds with […]\nThe post Blue Goose Mount Ideas: Elevate Your Waterfowl Trophy Display appeared first on Things You Ought to Know.",
        "content": "The crisp air bites, the sunrise paints the horizon in hues of orange and gold, and your heart pounds with the thrill of the hunt. The distinctive cry of the blue goose echoes across the marsh, a sou… [+9403 chars]",
        "published_at": "2025-05-20T03:10:37Z",
        "source": "Ie.edu",
        "url": "https://entrepreneurship.blogs.ie.edu/blue-goose-mount-ideas-elevate-your-waterfowl-trophy-display/"
    },
    {
        "title": "Bitcoin On Edge Of Extreme Greed—Is Euphoria Coming?",
        "description": "Data shows the Bitcoin trader sentiment has been teetering on the edge of extreme greed for the last few days, a sign that a break may be coming. Bitcoin Fear & Greed Index Is Sitting On The Boundary Of Extreme Greed The “Fear & Greed Index” refers to an indi…",
        "content": "Data shows the Bitcoin trader sentiment has been teetering on the edge of extreme greed for the last few days, a sign that a break may be coming.\r\nBitcoin Fear &amp; Greed Index Is Sitting On The Bou… [+3110 chars]",
        "published_at": "2025-05-20T03:00:36Z",
        "source": "Bitcoinist",
        "url": "https://bitcoinist.com/bitcoin-on-edge-of-extreme-greed-is-euphoria-coming/"
    },
    {
        "title": "The Ultimate Guide to Gloss Rose Gold Wrap: Everything You Need to Know",
        "description": "The world of automotive aesthetics is constantly evolving, and one trend has taken the industry by storm, offering a striking […]\nThe post The Ultimate Guide to Gloss Rose Gold Wrap: Everything You Need to Know appeared first on Things You Ought to Know.",
        "content": "The world of automotive aesthetics is constantly evolving, and one trend has taken the industry by storm, offering a striking blend of elegance, protection, and customization: the gloss rose gold wra… [+13440 chars]",
        "published_at": "2025-05-20T02:52:01Z",
        "source": "Ie.edu",
        "url": "https://entrepreneurship.blogs.ie.edu/the-ultimate-guide-to-gloss-rose-gold-wrap-everything-you-need-to-know/"
    },
    {
        "title": "Economic Digest: Nepal’s Business News in a Snap",
        "description": "KATHMANDU: Economic Digest offers a concise yet comprehensive overview of significant business happenings in Nepal, presented in easily digestible summaries. Nepal’s economic landscape presents a mixed outlook, reflecting both cautious optimism and persistent…",
        "content": "KATHMANDU: Economic Digest offers a concise yet comprehensive overview of significant business happenings in Nepal, presented in easily digestible summaries.\r\nNepal’s economic landscape presents a mi… [+13039 chars]",
        "published_at": "2025-05-20T02:15:51Z",
        "source": "Khabarhub.com",
        "url": "https://english.khabarhub.com/2025/20/468749/"
    },
    {
        "title": "Dazzle and Delight: Exploring the Beauty of Light Blue Sequin Fabric",
        "description": "Fabric’s Foundation: Understanding the Base Fabric Base Options The magic of light blue sequin fabric starts with its foundation. The […]\nThe post Dazzle and Delight: Exploring the Beauty of Light Blue Sequin Fabric appeared first on Things You Ought to Know.",
        "content": "Fabric’s Foundation: Understanding the Base\r\nFabric Base Options\r\nThe magic of light blue sequin fabric starts with its foundation. The base fabric, often unseen, plays a crucial role in determining … [+11175 chars]",
        "published_at": "2025-05-20T02:14:23Z",
        "source": "Ie.edu",
        "url": "https://entrepreneurship.blogs.ie.edu/dazzle-and-delight-exploring-the-beauty-of-light-blue-sequin-fabric/"
    },
    {
        "title": "Gold eases as Russia-Ukraine ceasefire optimism curb safe-haven demand",
        "description": "Gold prices experienced a slight dip as the dollar strengthened and optimism grew regarding potential ceasefire negotiations between Russia and Ukraine. Spot gold fell by 0.4% to $3,217.50 an ounce, while U.S. gold futures also declined. Investors are cautiou…",
        "content": "(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest new… [+330 chars]",
        "published_at": "2025-05-20T02:06:30Z",
        "source": "The Times of India",
        "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-eases-as-russia-ukraine-ceasefire-optimism-curb-safe-haven-demand/articleshow/121279964.cms"
    },
    {
        "title": "Experience Authentic Japanese Kimono Wedding Photography in Tokyo - New Global Website Now Live",
        "description": "[株式会社World map]\n[EN] Tokyo, Japan - May 2025 - INAI WEDDING WASOU, an Asakusa-based kimono wedding photo studio, has launched its new English-language website to welcome couples from around the globe.\n\n【JP】2025...",
        "content": "[EN] Tokyo, Japan May 2025 INAI WEDDING WASOU, an Asakusa-based kimono wedding photo studio, has launched its new English-language website to welcome couples from around the globe.\r\nJP20255INAI WEDDI… [+1517 chars]",
        "published_at": "2025-05-20T01:40:02Z",
        "source": "Prtimes.jp",
        "url": "https://prtimes.jp/main/html/rd/p/000000051.000043140.html"
    },
    {
        "title": "Gigabyte Makes Bold Desktop Debut With AI-Driven PC Lineup at Computex",
        "description": "DIY-centric computer maker Gigabyte showcases an expanded PC ecosystem that now includes pre-built desktop powerhouses for AI and gaming.\nHardware announcements are already coming in hot and fast at Computex, but one bit of news from Gigabyte marks a signific…",
        "content": "Hardware announcements are already coming in hot and fast at Computex, but one bit of news from Gigabyte marks a significant change for the company, which is best known for its desktop components and… [+5459 chars]",
        "published_at": "2025-05-20T01:30:00Z",
        "source": "PCMag.com",
        "url": "https://me.pcmag.com/en/old-desktop-pcs/29934/gigabyte-makes-bold-desktop-debut-with-ai-driven-pc-lineup-at-computex"
    },
    {
        "title": "Gigabyte Makes Bold Desktop Debut With AI-Driven PC Lineup at Computex",
        "description": "DIY-centric computer maker Gigabyte showcases an expanded PC ecosystem that now includes pre-built desktop powerhouses for AI and gaming.\nHardware announcements are already coming in hot and fast at Computex, but one bit of news from Gigabyte marks a signific…",
        "content": "Hardware announcements are already coming in hot and fast at Computex, but one bit of news from Gigabyte marks a significant change for the company, which is best known for its desktop components and… [+5459 chars]",
        "published_at": "2025-05-20T01:30:00Z",
        "source": "PCMag.com",
        "url": "https://uk.pcmag.com/desktop-pcs/158113/gigabyte-makes-bold-desktop-debut-with-ai-driven-pc-lineup-at-computex"
    },
    {
        "title": "Louise McSharry: My four go-to SPFs when you’re looking for more than just sun protection",
        "description": "Whether you’re heading on holiday or just enjoying the unusually sunny weather we’ve been having in Ireland lately, we all need sun protection. I think most of us are on the same page these days — we’ve seen the health statistics (skin cancer is the most comm…",
        "content": "Whether youre heading on holiday or just enjoying the unusually sunny weather weve been having in Ireland lately, we all need sun protection. I think most of us are on the same page these days weve s… [+5169 chars]",
        "published_at": "2025-05-20T01:30:00Z",
        "source": "Independent.ie",
        "url": "https://www.independent.ie/style/beauty/louise-mcsharry-my-four-go-to-spfs-when-youre-looking-for-more-than-just-sun-protection/a371103358.html"
    },
    {
        "title": "'Sell America' back on after massive debt warning...",
        "description": "'Sell America' back on after massive debt warning...\r\n\n \n \n \n (Top headline, 8th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:TRUMP TAX ROCKS TARGET...\r\nWorker exposes tariff price hike for popular items...\r\nSmall-business owner suing The Don for damages...\r\n30-…",
        "content": "Wall Street is on edge about American investments again after receiving a significant warning about the safest of all safe havens: US debt.\r\nMoodys downgraded Americas debt on Friday evening from its… [+5600 chars]",
        "published_at": "2025-05-20T01:16:36Z",
        "source": "CNN",
        "url": "https://www.cnn.com/2025/05/19/investing/stock-market-dow-sell-america-downgrade"
    },
    {
        "title": "40% off Ziwi Peak Steam Dry Dog Food Chicken + Orchard Fruits 3.2kg $115.2 + Delivery ($0 SYD C&C/ with $200 Order) @ Peek-a-Paw",
        "description": "Best Before Date: 31-May-2026 Before submitting this deal, we have checked prices across all major websites to ensure our price is the lowest. However, in case some competitors temporarily lower …",
        "content": "Best Before Date: 31-May-2026\r\nBefore submitting this deal, we have checked prices across all major websites to ensure our price is the lowest. However, in case some competitors temporarily lower the… [+1516 chars]",
        "published_at": "2025-05-20T00:50:33Z",
        "source": "Ozbargain.com.au",
        "url": "https://www.ozbargain.com.au/node/906507"
    },
    {
        "title": "Dashawn Jordan x Nike SB Dunk Low Releases Spring 2026",
        "description": "The Dashawn Jordan x Nike SB Dunk Low will be released in Spring 2026. Inspired by his roots in Arizona,...\nThe post Dashawn Jordan x Nike SB Dunk Low Releases Spring 2026 appeared first on .",
        "content": "The Dashawn Jordan x Nike SB Dunk Low will be released in Spring 2026. Inspired by his roots in Arizona, the shoes will have a rattlesnake print and retail for $130.\r\nIn 2026, Nike Skateboarding will… [+2107 chars]",
        "published_at": "2025-05-20T00:10:06Z",
        "source": "Sneakerfiles.com",
        "url": "https://www.sneakerfiles.com/dashawn-jordan-nike-sb-dunk-low/"
    },
    {
        "title": "Should You Buy This Dividend-Paying Gold Stock in 2025?",
        "description": "",
        "content": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;How did Moody's downgrade affect U.S. markets? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;What impact will 23andMe s… [+976 chars]",
        "published_at": "2025-05-19T23:43:47Z",
        "source": "Biztoc.com",
        "url": "https://biztoc.com/x/2bfc4de579052e86"
    },
    {
        "title": "Robert Kiyosaki Predicts Bitcoin To Reach $250,000: 'Buy More. Do Not Sell.'",
        "description": "Robert Kiyosaki predicts a significant surge in Bitcoin‘s (CRYPTO: BTC) value, attributing it to a potential collapse of the central bank system. What...",
        "content": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\r\nRobert Kiyosaki predicts a significant surge in Bitcoins (CRYPTO: BTC) value, attributing it to a… [+2045 chars]",
        "published_at": "2025-05-19T23:30:44Z",
        "source": "Yahoo Entertainment",
        "url": "https://finance.yahoo.com/news/robert-kiyosaki-predicts-bitcoin-reach-233044097.html"
    },
    {
        "title": "Bitcoin trading in six-figure territory shows BTC is ready to carry gold’s ‘baton’ — Fidelity exec",
        "description": "Key takeaways:<ul><li>Bitcoin’s Sharpe ratio converges with gold’s, indicating similar risk-adjusted returns, supporting its store-of-value role.\r\n</li><li>Gold outperformed Bitcoin in Q1 2025 with a 30.33% price gain versus Bitcoin’s 3.84%, driven by economi…",
        "content": "Key takeaways:\r\n<ul><li>Bitcoins Sharpe ratio converges with golds, indicating similar risk-adjusted returns, supporting its store-of-value role.\r\n</li><li>Gold outperformed Bitcoin in Q1 2025 with a… [+4505 chars]",
        "published_at": "2025-05-19T22:57:18Z",
        "source": "Cointelegraph",
        "url": "https://cointelegraph.com/news/bitcoin-trading-in-six-figure-territory-shows-btc-is-ready-to-carry-gold-s-baton-fidelity-exec"
    },
    {
        "title": "15k-Mile 1993 Honda Civic Del Sol Si at No Reserve",
        "description": "This 1993 Honda Civic Del Sol was initially sold through Horst-Zimmerman Honda in Rock Island, Illinois, and remained registered in the state under original ownership until 2019. Finished in Samba Green over gray cloth, the car is powered by a 1.6-liter inlin…",
        "content": "This 1993 Honda Civic Del Sol was initially sold through Horst-Zimmerman Honda in Rock Island, Illinois, and remained registered in the state under original ownership until 2019. Finished in Samba Gr… [+2522 chars]",
        "published_at": "2025-05-19T22:53:11Z",
        "source": "Bringatrailer.com",
        "url": "https://bringatrailer.com/listing/1993-honda-civic-del-sol-32/"
    },
    {
        "title": "Get exposure beyond Australian gold miners with this ASX ETF",
        "description": "This ASX ETF is up more than 30% already this year. \nThe post Get exposure beyond Australian gold miners with this ASX ETF appeared first on The Motley Fool Australia.",
        "content": "While many investors have felt the volatility so far this year across Australian and international markets, this gold miner ETF has charged ahead. \r\nGold is a commodity that trades based on supply an… [+2196 chars]",
        "published_at": "2025-05-19T22:38:21Z",
        "source": "Motley Fool Australia",
        "url": "https://www.fool.com.au/2025/05/20/get-exposure-beyond-australian-gold-miners-with-this-asx-etf/"
    },
    {
        "title": "[Latest] Global Sustainable Pharmaceutical Packaging Market Size/Share Worth USD 343.01 Billion by 2034 at a 15.13% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth Rate, Value, SWOT)",
        "description": "[220+ Pages Latest Report] According to a market research study published by Custom Market Insights, the demand analysis of Global Sustainable Pharmaceutical Packaging Market size & share revenue was valued at approximately USD 85.86 Billion in 2024 and is ex…",
        "content": "Austin, TX, USa, May 20, 2025 (GLOBE NEWSWIRE) -- Custom Market Insights has published a new research report titled Sustainable Pharmaceutical Packaging Market Size, Trends and Insights By Material (… [+28479 chars]",
        "published_at": "2025-05-19T22:30:00Z",
        "source": "GlobeNewswire",
        "url": "https://www.globenewswire.com/news-release/2025/05/19/3084469/0/en/Latest-Global-Sustainable-Pharmaceutical-Packaging-Market-Size-Share-Worth-USD-343-01-Billion-by-2034-at-a-15-13-CAGR-Custom-Market-Insights-Analysis-Outlook-Leaders-Report-Trends-.html"
    },
    {
        "title": "The Good Guys - 15% Cashback (Uncapped, Exclusions Apply) on Online Purchases @ TopCashback",
        "description": "A fresh uncapped Cashback for The Good Guys by TopCashback. 15% Cashback Uncapped with exclusions. Cashback terms and exclusions What will stop me getting my cashback Cashback is ineligible on …",
        "content": "A fresh uncapped Cashback for The Good Guys by TopCashback.\r\n15% Cashback Uncapped with exclusions.\r\nCashback terms and exclusions\r\nWhat will stop me getting my cashbackCashback is ineligible on prod… [+1029 chars]",
        "published_at": "2025-05-19T22:18:32Z",
        "source": "Ozbargain.com.au",
        "url": "https://www.ozbargain.com.au/node/906479"
    },
    {
        "title": "Gold price still able to hit 60,000-baht mark",
        "description": "Despite a recent price contraction, the domestic gold price remains on course to reach 60,000 baht per baht-weight, traders say, as they caution that a high degree of volatility is on the horizon.",
        "content": "Despite a recent price contraction, the domestic gold price remains on course to reach 60,000 baht per baht-weight, traders say, as they caution that a high degree of volatility is on the horizon.\r\nL… [+3301 chars]",
        "published_at": "2025-05-19T22:07:00Z",
        "source": "Bangkok Post",
        "url": "https://www.bangkokpost.com/business/general/3029762/gold-price-still-able-to-hit-60-000-baht-mark"
    },
    {
        "title": "Gold price still capable of reaching B60,000, say Thai traders",
        "description": "Despite a recent correction, the domestic gold price in Thailand remains on course to reach 60,000 baht per baht-weight, traders say, as they caution that a high degree of volatility is on the horizon.",
        "content": "Despite a recent correction, the domestic gold price in Thailand remains on course to reach 60,000 baht per baht-weight, traders say, as they caution that a high degree of volatility is on the horizo… [+3399 chars]",
        "published_at": "2025-05-19T22:07:00Z",
        "source": "Bangkok Post",
        "url": "https://www.bangkokpost.com/business/general/3029762/gold-price-still-capable-of-reaching-b60-000-say-thai-traders"
    },
    {
        "title": "Best Bitcoin & Crypto Casinos for 2025, Rated by Sharp Gamblers",
        "description": "Get started with Bitcoin gambling in 2025. We rank the top crypto casinos offering big bonuses, fast withdrawals, and provably fair games for online play. Get started with Bitcoin gambling in 2025. We rank the top crypto casinos offering big bonuses, fast wit…",
        "content": "Dallas, May 19, 2025 (GLOBE NEWSWIRE) -- \r\nBitcoin casinos have emerged as the new gold standard for players seeking speed, privacy, and security. With lightning-fast payouts, blockchain-level transp… [+38353 chars]",
        "published_at": "2025-05-19T21:17:00Z",
        "source": "GlobeNewswire",
        "url": "https://www.globenewswire.com/news-release/2025/05/19/3084444/0/en/Best-Bitcoin-Crypto-Casinos-for-2025-Rated-by-Sharp-Gamblers.html"
    },
    {
        "title": "Bitcoin 30-Day Correlation To Gold Drops – Macro Shift Or Noise?",
        "description": "Bitcoin saw a sharp reversal on Sunday, surging to $107,000 before retracing over 4% in just a few hours — a classic fakeout that has left the market shaken. The rejection at local highs has sparked debate among top analysts: some warn of a looming correction…",
        "content": "Bitcoin saw a sharp reversal on Sunday, surging to $107,000 before retracing over 4% in just a few hours a classic fakeout that has left the market shaken. The rejection at local highs has sparked de… [+4083 chars]",
        "published_at": "2025-05-19T21:00:57Z",
        "source": "Bitcoinist",
        "url": "https://bitcoinist.com/bitcoin-30-day-correlation-to-gold-drops-macro-shift-or-noise/"
    },
    {
        "title": "Tokenized stocks, bigger than Bitcoin?",
        "description": "Bitcoin may be the appetizer before tokenized stock markets.",
        "content": "While Bitcoin continues to dominate headlines, many industry leaders are looking ahead to tokenized stocks.\r\nTokenization refers to the process of creating a digital representation of an asset on a b… [+2218 chars]",
        "published_at": "2025-05-19T20:39:44Z",
        "source": "TheStreet",
        "url": "https://www.thestreet.com/crypto/innovation/tokenized-stocks-bigger-than-bitcoin"
    },
    {
        "title": "Dazzling Blue: Achieving Stunning Finishes with Blue Metal Flake Powder Coat",
        "description": "Introduction The world of custom finishes is a realm of endless possibilities, where creativity and innovation converge to transform ordinary […]\nThe post Dazzling Blue: Achieving Stunning Finishes with Blue Metal Flake Powder Coat appeared first on Things Yo…",
        "content": "Introduction\r\nThe world of custom finishes is a realm of endless possibilities, where creativity and innovation converge to transform ordinary objects into extraordinary works of art. From the subtle… [+16451 chars]",
        "published_at": "2025-05-19T20:15:43Z",
        "source": "Ie.edu",
        "url": "https://entrepreneurship.blogs.ie.edu/dazzling-blue-achieving-stunning-finishes-with-blue-metal-flake-powder-coat/"
    }
]